eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаТМЦ/абс_ЗаявкаНаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТМЦ</name>
  <comment>(Проектный учет)</comment>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.абс_ЗаявкиНаОбеспечение</registerRecords>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаОбеспечениеТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйРП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановойОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийЗаявкаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыйСрокОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоНазначения</name>
    <type>
      <types>CatalogRef.МестаЭксплуатацииПоСооружению</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОтДиректораДИРИнициатора</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетнаяКатегория</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПолучателя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПакетыДокументов_удалить</name>
    <attributes>
      <name>Перемещение</name>
      <type>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Передача</name>
      <type>
        <types>DocumentRef.ПередачаТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеНакладная</name>
      <type>
        <types>DocumentRef.ТребованиеНакладная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеПоПроектам</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеНоменклатурыПоПроектам</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ЗаявкиНаОбеспечение/абс_ЗаявкиНаОбеспечение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЗаявкиНаОбеспечение</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТМЦ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыОперацийПередачаТоваров/ВидыОперацийПередачаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПередачаТоваров</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ВПереработку</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ИзПереработки</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВПереработкуБрак</name>
  </enumValues>
  <enumValues>
    <name>абс_ОборудованиеВПереработку</name>
  </enumValues>
  <enumValues>
    <name>абс_ОтКонтрагента</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаТМЦ/ManagerModule.bsl
// В функции описано, какие данные следует сохранять в шаблоне
Функция СтруктураДополнительныхДанныхФормы() Экспорт
	
	Возврат ХранилищаНастроек.ДанныеФорм.СформироватьСтруктуруДополнительныхДанных("Товары,ВозвратнаяТара");
	
КонецФункции

Функция ПроверкаОстатков(Ссылка) Экспорт 

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КолОстаток
	               |ИЗ
	               |	РегистрНакопления.абс_ЗаявкиНаОбеспечение.Остатки(&КонДата, Заказ = &Заказ) КАК ЗаказыОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыОстатки.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр( "КонДата", Ссылка.Дата);
	Запрос.УстановитьПараметр( "Заказ",   Ссылка);

	Результат = Запрос.Выполнить();
    
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция СформироватьПеремещениеТоваров(СсылкаНаДокументОснование, ОткрыватьФорму = Истина) Экспорт
	
	Перем ОбъектПеремещениеТоваров;
	
	
	Если ПроверкаОстатков(СсылкаНаДокументОснование) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	ОбъектПеремещениеТоваров = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ОбъектПеремещениеТоваров.Заполнить(СсылкаНаДокументОснование);
	//ОбъектПеремещениеТоваров.Записать();
	
	Если ОбъектПеремещениеТоваров <> Неопределено и ОткрыватьФорму Тогда
		ОбъектПеремещениеТоваров.ПолучитьФорму("ФормаДокумента").Открыть();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьПередачаТоваров(СсылкаНаДокументОснование, ОткрыватьФорму = Истина) Экспорт
	
	ОбъектПередачаТоваров = Документы.ПередачаТоваров.СоздатьДокумент();
	// ШАПКА
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ОбъектПередачаТоваров, СсылкаНаДокументОснование);
	
	ОбъектПередачаТоваров.ВидОперации = Перечисления.ВидыОперацийПередачаТоваров.абс_ОборудованиеВПереработку;
	ОбъектПередачаТоваров.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
	ОбъектПередачаТоваров.абс_ЗаявкаНаТМЦ = СсылкаНаДокументОснование;
	ОбъектПередачаТоваров.Контрагент = СсылкаНаДокументОснование.Контрагент;
	ОбъектПередачаТоваров.Дата 		= ТекущаяДата();
	ОбъектПередачаТоваров.Склад    	= СсылкаНаДокументОснование.СкладПолучатель;
	ОбъектПередачаТоваров.Ответственный = СсылкаНаДокументОснование.Ответственный;
	ОбъектПередачаТоваров.абс_Статус  = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
	ОбъектПередачаТоваров.абс_Отпустил = СсылкаНаДокументОснование.Ответственный;
	ОбъектПередачаТоваров.абс_ЦФО = СсылкаНаДокументОснование.ЦФО;
	Если РольДоступна("абс_СотрудникСклада") Тогда
		ОбъектПередачаТоваров.ОтражатьВУправленческомУчете = Истина;		
		ОтражатьВБухгалтерскомУчете = Истина;
		ОтражатьВНалоговомУчете 	= Истина;
	КонецЕсли;
	// ТАБЛИЦА ТОВАРОВ
	ЗаполнитьОстаткамиТоваровПоЗаказу(СсылкаНаДокументОснование, ОбъектПередачаТоваров, "абс_Оборудование");
	
	Если ОткрыватьФорму Тогда
		ОбъектПередачаТоваров.ПолучитьФорму("ФормаДокумента").Открыть();
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьТребованиеНакладная(СсылкаНаДокументОснование, ОткрыватьФорму = Истина) Экспорт
	
	ОбъектТН = Документы.ТребованиеНакладная.СоздатьДокумент();
	Если ТипЗнч(СсылкаНаДокументОснование) = Тип("ДокументСсылка.абс_ЗаявкаНаТМЦ") Тогда 
		// Если в качестве основания используется сама заявка, документ создается кнопкой "Ввода на основании" и записывать его должен пользователь, поэтому только открываем форму
		// ШАПКА
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ОбъектТН, СсылкаНаДокументОснование);
		ОбъектТН.Дата = СсылкаНаДокументОснование.Дата + 1;
		ОбъектТН.Подразделение = СсылкаНаДокументОснование.ЦФО;
		ОбъектТН.абс_Отпустил = СсылкаНаДокументОснование.Ответственный;
		ОбъектТН.ОтражатьВУправленческомУчете = Истина;
		ОбъектТН.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		ОбъектТН.Склад = СсылкаНаДокументОснование.СкладПолучатель;		
		ОбъектТН.абс_ЗаявкаНаТМЦ = СсылкаНаДокументОснование;
		// ТАБЛИЦА МАТЕРИАЛОВ
		ЗаполнитьОстаткамиТоваровПоЗаказу(СсылкаНаДокументОснование, ОбъектТН, "Материалы");
		Если ОткрыватьФорму Тогда 
			ОбъектТН.ПолучитьФорму("ФормаДокумента").Открыть();
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли ТипЗнч(СсылкаНаДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
		// Типовой ввод на основании
		ОбъектТН.Заполнить(СсылкаНаДокументОснование.Ссылка);
		// Дополнительные реквизиты
		ОбъектТН.Дата = СсылкаНаДокументОснование.Дата + 1;
		ОбъектТН.Подразделение = СсылкаНаДокументОснование.Подразделение;
		Попытка
			ОбъектТН.Записать();
		Исключение
			ОбщегоНазначения.Сообщение(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Возврат ОбъектТН.Ссылка;
	
КонецФункции

Функция ПолучитьОстатокТМЦПоЗаявке(СсылкаНаЗаявку) Экспорт 
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КолОстаток,
	               |	ЗаказыОстатки.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияЗаказа,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ЕдиницаИзмеренияЗаказаКоэффициент,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	               |	ЗаказыОстатки.Проект,
	               |	ЗаказыОстатки.СерияНоменклатуры,
	               |	ЗаказыОстатки.ХарактеристикаНоменклатуры,
	               |	ЗаказыОстатки.Заказ.ЦФО КАК абс_ЦФО,
	               |	ЗаказыОстатки.Заказ.ЦФУ КАК абс_ЦФУ,
	               |	ЗаказыОстатки.Заказ.Контрагент.абс_ТипыКонтрагентов КАК абс_ТипКонтрагента
	               |ИЗ
	               |	РегистрНакопления.абс_ЗаявкиНаОбеспечение.Остатки(&КонДата, Заказ = &Заказ) КАК ЗаказыОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыОстатки.Номенклатура,
	               |	ЗаказыОстатки.Номенклатура.СтавкаНДС,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	               |	ЗаказыОстатки.Проект,
	               |	ЗаказыОстатки.СерияНоменклатуры,
	               |	ЗаказыОстатки.ХарактеристикаНоменклатуры,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков,
	               |	ЗаказыОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	               |	ЗаказыОстатки.Заказ.ЦФО,
	               |	ЗаказыОстатки.Заказ.ЦФУ,
	               |	ЗаказыОстатки.Заказ.Контрагент.абс_ТипыКонтрагентов
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	//Запрос.УстановитьПараметр("КонДата", Новый Граница(СсылкаНаЗаявку.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата", Неопределено);
	Запрос.УстановитьПараметр("Заказ", СсылкаНаЗаявку);
	

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
	
КонецФункции

Процедура ЗаполнитьОстаткамиТоваровПоЗаказу(СсылкаНаЗаявку, ДокументОбъект, ТабЧастьИмя) Экспорт
	
	ТабЧасть = ДокументОбъект[ТабЧастьИмя];
	Выборка = ПолучитьОстатокТМЦПоЗаявке(СсылкаНаЗаявку);
	
	ЕстьЕдиница  = Не Метаданные.НайтиПоТипу(ТипЗнч(ТабЧасть)).Реквизиты.Найти("ЕдиницаИзмерения") = Неопределено;
 	ЕстьКачество = Не Метаданные.НайтиПоТипу(ТипЗнч(ТабЧасть)).Реквизиты.Найти("Качество") = Неопределено;
		
	Пока Выборка.Следующий() цикл
		Если Выборка.КолОстаток <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Количество = Выборка.КолОстаток;
		НоваяСтрока = ТабЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Количество = Количество;
		//если в таб части есть реквизит ЕДиницаИзмерения - заполним единицу по данным заказа и пересчитаем количество
		Если ЕстьЕдиница Тогда
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияЗаказа;
			НоваяСтрока.ЕдиницаИзмеренияМест = Выборка.ЕдиницаИзмеренияЗаказа; 
			НоваяСтрока.Количество = Количество * Выборка.Коэффициент / Выборка.ЕдиницаИзмеренияЗаказаКоэффициент;
			НоваяСтрока.Коэффициент = Выборка.ЕдиницаИзмеренияЗаказаКоэффициент;
		КонецЕсли;
		Если ЕстьКачество Тогда
			НоваяСтрока.Качество = Справочники.Качество.Новый;
		КонецЕсли;
		НоваяСтрока.СерияНоменклатуры	 			= Выборка.СерияНоменклатуры;
		НоваяСтрока.ХарактеристикаНоменклатуры	 	= Выборка.ХарактеристикаНоменклатуры;
		Если Не Метаданные.НайтиПоТипу(ТипЗнч(ТабЧасть)).Реквизиты.Найти("абс_Проект") = Неопределено Тогда 
			НоваяСтрока.абс_Проект = Выборка.Проект;
		КонецЕсли;
		Если Не Метаданные.НайтиПоТипу(ТипЗнч(ТабЧасть)).Реквизиты.Найти("абс_ПроектНовый") = Неопределено Тогда
			НоваяСтрока.абс_ПроектНовый = Выборка.Проект;
		КонецЕсли;
		
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументОбъект); 
	КонецЦикла;
	
КонецПроцедуры
